bubblesnake/esp-socketio-client/components/esp_socketio_client/examples/linux/sdkconfig.defaults
CONFIG_IDF_TARGET="linux"
CONFIG_IDF_TARGET_LINUX=y
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=n
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_WEBSOCKET_URI="ws://<ip>/socket.io/?EIO=4&transport=websocket"
